Repository: M-Files/VAF.Extensions.Community
Catalog: MFiles.VAF.Extensions/Resources/Exceptions/MFSearchBuilderExtensionMethods.*.resx
Languages: fr

# CannotResolveAlias_NotFound
source: Could not resolve the identifier with alias/GUID {0} in the current vault.
fr: Impossible de résoudre l'identificateur pour l'alias/GUID {0} dans ce coffre.

# CannotResolveAlias_VaultReferenceNull
source: The search builder or vault reference is null, so the identifier with alias/GUID {0} cannot be resolved.
fr: Le search builder ou la vault reference vaut null, impossible de résoudre l'identificateur pour l'alias/GUID {0}.

# DataFunctionCallMonthInvalid
source: The value ({0}) should contain a two-digit month number (e.g. '03').
fr: La valeur ({0}) doit contenir a mois sur 2 chiffres (ex. '03').

# DataFunctionCallMonthOutOfRange
source: The month value ({0}) should be between 1 and 12, inclusive.
fr: La valeur pour le mois ({0}) doit être comprise entre 1 et 12 uniquement.

# DataFunctionCallValueNull
source: When using a DataFunctionCall, the provided value cannot be null.
fr: Lors de l'utilisation de la fonction DataFunctionCall, la valeur transmise ne peut pas valoir null.

# DataFunctionCallYearAndMonthInvalid
source: The value ({0}) is not of the expected format (YYYY-MM).
fr: La valeur ({0}) n'est pas dans le format attendu (YYYY-MM).

# DataFunctionCallYearInvalid
source: The year must be four digits.
fr: L'année doit compoter 4 chiffres.

# FileSize_Negative
source: The size parameter must be zero or larger.
fr: Le paramètre taille doit être 0 ou supérieur.

source: Handled data types cannot be empty.
fr: Les données de type Handled ne peuvent pas être vides.

# IndirectionLevelPointsToInvalidObjectType
source: An indirection level references an object type with ID {0}, but this object type could not be found.
fr: Une indirection pointe vers le type d'objet avec l'ID {0}, mais celui ci ne peut être trouvé.

# IndirectionLevelPointsToValueList
source: An indirection level references an value list with ID {0}, but this list does not refer to an object type (cannot be used with value lists).
fr: Une indirection pointe vers la liste de valeur avec l'ID {0}, mais cette liste n'est pas associé à un type d'objet (impossible de l'utiliser en tant que liste de valeur).

# IndirectionLevelPropertyNotFound
source: An indirection level references a property definition with ID {0}, but this property definition could not be found.
fr: Une indirection pointe vers la définition de propriété avec l'ID {0}, mais celle ci n'a pu être trouvée.

# IndirectionLevelPropertyNotOfExpectedType
source: The indirection level for property {0} does not reference a lookup-style property definition (actual type: {1}).
fr: Le niveau d'indirection pour la propriété {0} ne s'associe pas à une définition de propriété de type lookup (type actuel : {1}).

# ObjectIDs_ConditionTypeInvalid
source: The condition type {0} is not supported for object Ids.
fr: Le type de condition {0} n'est pas supporté pour les object Ids.

# ObjectIDs_ObjectIDMustBeGreaterThanZero
source: Object Id must be greater than 0.
fr: l'ID d'un objet doit être supérieur à 0.

# ObjectIDs_SegmentIndexMustBeZeroOrLarger
source: The segment index must be zero or larger.
fr: L'index du segment doit être supérieur à 0.

# ObjectIDs_SegmentSizeMustBeOneOrLarger
source: The segment size must be one or larger.
fr: La taille du segment doit être de 1 ou supérieur.

# OneOf_CollectionEmpty
source: The lookup collection does not contain any items.
fr: La collection lookup ne contient aucun élément.

# Permissions_ConditionTypeInvalid
source: The condition type {0} is not supported for permission-based search conditions.
fr: Le type de condition {0} ne permet pas les conditions de recherches basées sur les permissions.

# SearchConditionsNull
source: The search builder's conditions are null.
fr: Les conditions du search builder ont une valeur null.

# SegmentedSearch_EndSegmentMustBeGreaterThanZero
source: The end segment must be greater than zero.
fr: Le segment final doit être supérieur à 0.

# SegmentedSearch_SearchTimeoutMustBeZeroOrLarger
source: The search timeout must be greater than zero, or zero to indicate an indefinite timeout.
fr: Le timeout de la recherche doit être supérieur à 0. Ou 0 si vous ne voulez aucun timeout.

# SegmentedSearch_SegmentSizeMustBeGreaterThanZero
source: The segment size must be greater than zero.
fr: La taille du segment doit être supérieure à 0.

# SegmentedSearch_StartSegmentMustBeZeroOrLarger
source: The starting segment must be zero or larger.
fr: Le segment de départ doit être 0 ou supérieur.

# VaultObjectSearchOperationsReferenceNull
source: The vault's ObjectSearchOperations reference is null.
fr: La référence au coffre pour ObjectSearchOperations a la valeur null.

# VaultReferenceNull
source: The search builder's vault reference is null.
fr: La réféfrence au coffre pour le search builder a la valeur null.
